{"backend": "tensorflow", "config": [{"config": {"kernel_regularizer": null, "kernel_constraint": null, "recurrent_activation": "hard_sigmoid", "batch_input_shape": [null, null, 12], "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "implementation": 0, "unroll": false, "bias_regularizer": null, "go_backwards": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "unit_forget_bias": true, "recurrent_dropout": 0.0, "activity_regularizer": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "name": "lstm_1", "dropout": 0.0, "use_bias": true, "recurrent_regularizer": null, "recurrent_constraint": null, "units": 50, "trainable": true, "return_sequences": true, "dtype": "float32", "stateful": false, "activation": "softsign", "bias_constraint": null}, "class_name": "LSTM"}, {"config": {"trainable": true, "rate": 0.2, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"kernel_regularizer": null, "kernel_constraint": null, "recurrent_activation": "hard_sigmoid", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "implementation": 0, "go_backwards": false, "bias_regularizer": null, "unroll": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "unit_forget_bias": true, "recurrent_dropout": 0.0, "activity_regularizer": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "name": "lstm_2", "dropout": 0.0, "use_bias": true, "recurrent_regularizer": null, "recurrent_constraint": null, "units": 80, "trainable": true, "return_sequences": false, "stateful": false, "activation": "softsign", "bias_constraint": null}, "class_name": "LSTM"}, {"config": {"trainable": true, "rate": 0.1, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"kernel_regularizer": null, "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "units": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "name": "dense_1"}, "class_name": "Dense"}, {"config": {"activation": "linear", "trainable": true, "name": "activation_1"}, "class_name": "Activation"}], "keras_version": "2.0.2", "class_name": "Sequential"}