{"keras_version": "2.0.2", "class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "LSTM", "config": {"activation": "softsign", "recurrent_constraint": null, "units": 50, "return_sequences": true, "recurrent_dropout": 0.0, "bias_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "recurrent_regularizer": null, "dropout": 0.0, "activity_regularizer": null, "use_bias": true, "unroll": false, "bias_constraint": null, "kernel_constraint": null, "batch_input_shape": [null, null, 12], "go_backwards": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "lstm_1", "implementation": 0, "unit_forget_bias": true, "stateful": false, "dtype": "float32", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_activation": "hard_sigmoid", "kernel_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "rate": 0.2}}, {"class_name": "LSTM", "config": {"activation": "softsign", "recurrent_constraint": null, "units": 80, "return_sequences": false, "recurrent_dropout": 0.0, "bias_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "recurrent_regularizer": null, "dropout": 0.0, "activity_regularizer": null, "use_bias": true, "unroll": false, "bias_constraint": null, "kernel_constraint": null, "go_backwards": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "lstm_2", "implementation": 0, "unit_forget_bias": true, "stateful": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_activation": "hard_sigmoid", "kernel_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "rate": 0.1}}, {"class_name": "Dense", "config": {"activation": "linear", "bias_constraint": null, "units": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1", "bias_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null}}, {"class_name": "Activation", "config": {"activation": "linear", "trainable": true, "name": "activation_1"}}]}