{"class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "LSTM", "config": {"stateful": false, "dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "use_bias": true, "recurrent_constraint": null, "return_sequences": true, "recurrent_regularizer": null, "kernel_regularizer": null, "dtype": "float32", "recurrent_activation": "hard_sigmoid", "unit_forget_bias": true, "units": 50, "activity_regularizer": null, "activation": "softsign", "name": "lstm_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "go_backwards": false, "trainable": true, "recurrent_dropout": 0.0, "bias_regularizer": null, "implementation": 0, "bias_constraint": null, "batch_input_shape": [null, null, 12], "unroll": false}}, {"class_name": "Dropout", "config": {"rate": 0.2, "name": "dropout_1", "trainable": true}}, {"class_name": "LSTM", "config": {"stateful": false, "dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "use_bias": true, "return_sequences": false, "recurrent_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "recurrent_activation": "hard_sigmoid", "implementation": 0, "unit_forget_bias": true, "kernel_constraint": null, "units": 80, "activation": "softsign", "name": "lstm_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "go_backwards": false, "trainable": true, "recurrent_dropout": 0.0, "bias_regularizer": null, "recurrent_constraint": null, "bias_constraint": null, "unroll": false}}, {"class_name": "Dropout", "config": {"rate": 0.1, "name": "dropout_2", "trainable": true}}, {"class_name": "Dense", "config": {"units": 1, "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "trainable": true, "bias_regularizer": null, "name": "dense_1", "kernel_constraint": null, "activation": "linear", "bias_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "linear"}}], "keras_version": "2.0.2"}