{"config": [{"config": {"recurrent_regularizer": null, "recurrent_constraint": null, "unit_forget_bias": true, "batch_input_shape": [null, null, 12], "kernel_regularizer": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "stateful": false, "bias_regularizer": null, "implementation": 0, "go_backwards": false, "use_bias": true, "units": 50, "activation": "softsign", "recurrent_dropout": 0.0, "name": "lstm_1", "dropout": 0.0, "return_sequences": true, "kernel_constraint": null, "dtype": "float32", "activity_regularizer": null, "trainable": true, "unroll": false, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "recurrent_activation": "hard_sigmoid"}, "class_name": "LSTM"}, {"config": {"rate": 0.2, "name": "dropout_1", "trainable": true}, "class_name": "Dropout"}, {"config": {"recurrent_regularizer": null, "recurrent_constraint": null, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "unroll": false, "bias_regularizer": null, "implementation": 0, "go_backwards": false, "units": 80, "activation": "softsign", "recurrent_dropout": 0.0, "name": "lstm_2", "dropout": 0.0, "return_sequences": false, "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "trainable": true, "stateful": false, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "recurrent_activation": "hard_sigmoid"}, "class_name": "LSTM"}, {"config": {"rate": 0.2, "name": "dropout_2", "trainable": true}, "class_name": "Dropout"}, {"config": {"activation": "linear", "kernel_regularizer": null, "name": "dense_1", "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "trainable": true, "bias_constraint": null, "units": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"name": "activation_1", "trainable": true, "activation": "linear"}, "class_name": "Activation"}], "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.0.2"}