{"backend": "tensorflow", "keras_version": "2.0.2", "class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"recurrent_dropout": 0.0, "bias_regularizer": null, "batch_input_shape": [null, null, 12], "recurrent_regularizer": null, "dtype": "float32", "implementation": 0, "return_sequences": true, "kernel_regularizer": null, "go_backwards": false, "unit_forget_bias": true, "stateful": false, "unroll": false, "bias_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "use_bias": true, "dropout": 0.0, "units": 50, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_constraint": null, "activity_regularizer": null, "activation": "softsign", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "name": "lstm_1", "recurrent_activation": "hard_sigmoid", "trainable": true}}, {"class_name": "Dropout", "config": {"rate": 0.2, "name": "dropout_1", "trainable": true}}, {"class_name": "LSTM", "config": {"recurrent_dropout": 0.0, "bias_regularizer": null, "recurrent_regularizer": null, "implementation": 0, "return_sequences": false, "kernel_regularizer": null, "go_backwards": false, "unit_forget_bias": true, "stateful": false, "unroll": false, "bias_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "use_bias": true, "dropout": 0.0, "units": 80, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_constraint": null, "activity_regularizer": null, "activation": "softsign", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "name": "lstm_2", "recurrent_activation": "hard_sigmoid", "trainable": true}}, {"class_name": "Dropout", "config": {"rate": 0.2, "name": "dropout_2", "trainable": true}}, {"class_name": "Dense", "config": {"use_bias": true, "bias_regularizer": null, "units": 1, "kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1", "bias_constraint": null, "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "linear", "trainable": true}}]}