{"config": [{"config": {"use_bias": true, "bias_constraint": null, "units": 50, "activity_regularizer": null, "kernel_constraint": null, "trainable": true, "activation": "softsign", "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "go_backwards": false, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "batch_input_shape": [null, null, 12], "return_sequences": true, "implementation": 0, "stateful": false, "unit_forget_bias": true, "unroll": false, "recurrent_regularizer": null, "name": "lstm_1", "recurrent_activation": "hard_sigmoid", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "recurrent_dropout": 0.0, "dropout": 0.0, "recurrent_constraint": null, "dtype": "float32", "bias_regularizer": null}, "class_name": "LSTM"}, {"config": {"name": "dropout_1", "rate": 0.2, "trainable": true}, "class_name": "Dropout"}, {"config": {"units": 80, "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "trainable": true, "activation": "softsign", "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "go_backwards": false, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "dropout": 0.0, "return_sequences": false, "implementation": 0, "stateful": false, "unit_forget_bias": true, "unroll": false, "recurrent_regularizer": null, "name": "lstm_2", "recurrent_activation": "hard_sigmoid", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "recurrent_dropout": 0.0, "recurrent_constraint": null, "bias_regularizer": null}, "class_name": "LSTM"}, {"config": {"name": "dropout_2", "rate": 0.2, "trainable": true}, "class_name": "Dropout"}, {"config": {"use_bias": true, "bias_constraint": null, "units": 1, "activity_regularizer": null, "kernel_constraint": null, "trainable": true, "name": "dense_1", "activation": "linear", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "activation_1", "activation": "linear", "trainable": true}, "class_name": "Activation"}], "backend": "tensorflow", "keras_version": "2.0.2", "class_name": "Sequential"}