{"backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"recurrent_dropout": 0.0, "stateful": false, "use_bias": true, "bias_constraint": null, "unit_forget_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "name": "lstm_1", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_activation": "hard_sigmoid", "activation": "softsign", "go_backwards": false, "recurrent_regularizer": null, "kernel_regularizer": null, "dropout": 0.0, "implementation": 0, "kernel_constraint": null, "unroll": false, "batch_input_shape": [null, null, 12], "recurrent_constraint": null, "units": 50, "activity_regularizer": null, "bias_regularizer": null, "return_sequences": true, "dtype": "float32"}}, {"class_name": "Dropout", "config": {"rate": 0.2, "name": "dropout_1", "trainable": true}}, {"class_name": "LSTM", "config": {"recurrent_dropout": 0.0, "stateful": false, "use_bias": true, "bias_constraint": null, "unit_forget_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "name": "lstm_2", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_activation": "hard_sigmoid", "activation": "softsign", "go_backwards": false, "recurrent_regularizer": null, "kernel_regularizer": null, "dropout": 0.0, "implementation": 0, "kernel_constraint": null, "unroll": false, "activity_regularizer": null, "recurrent_constraint": null, "units": 80, "bias_regularizer": null, "return_sequences": false}}, {"class_name": "Dropout", "config": {"rate": 0.2, "name": "dropout_2", "trainable": true}}, {"class_name": "Dense", "config": {"use_bias": true, "bias_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_regularizer": null, "name": "dense_1", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "units": 1, "kernel_regularizer": null, "kernel_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "linear"}}], "keras_version": "2.0.2"}