{"class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.0.2", "config": [{"class_name": "LSTM", "config": {"unit_forget_bias": true, "dtype": "float32", "name": "lstm_1", "kernel_constraint": null, "units": 50, "unroll": false, "go_backwards": false, "implementation": 0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "dropout": 0.0, "recurrent_regularizer": null, "recurrent_dropout": 0.0, "recurrent_constraint": null, "activity_regularizer": null, "bias_constraint": null, "recurrent_activation": "hard_sigmoid", "batch_input_shape": [null, null, 12], "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "activation": "softsign", "use_bias": true, "bias_regularizer": null, "stateful": false, "trainable": true, "return_sequences": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "rate": 0.2}}, {"class_name": "LSTM", "config": {"unit_forget_bias": true, "name": "lstm_2", "kernel_constraint": null, "kernel_regularizer": null, "unroll": false, "go_backwards": false, "implementation": 0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "dropout": 0.0, "recurrent_regularizer": null, "recurrent_dropout": 0.0, "recurrent_constraint": null, "activity_regularizer": null, "bias_constraint": null, "recurrent_activation": "hard_sigmoid", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 80, "activation": "softsign", "use_bias": true, "bias_regularizer": null, "stateful": false, "trainable": true, "return_sequences": false}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "rate": 0.2}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_constraint": null, "kernel_regularizer": null, "name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "activity_regularizer": null, "use_bias": true, "bias_regularizer": null, "activation": "linear", "trainable": true, "kernel_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "linear", "trainable": true}}]}