{"backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"use_bias": true, "bias_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "units": 50, "return_sequences": true, "stateful": false, "name": "lstm_1", "recurrent_regularizer": null, "dropout": 0.0, "activity_regularizer": null, "trainable": true, "dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "activation": "softsign", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "unit_forget_bias": true, "kernel_constraint": null, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_dropout": 0.0, "batch_input_shape": [null, null, 12], "recurrent_activation": "hard_sigmoid", "go_backwards": false, "recurrent_constraint": null, "implementation": 0}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "rate": 0.2}}, {"class_name": "LSTM", "config": {"stateful": false, "bias_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "units": 80, "return_sequences": false, "use_bias": true, "name": "lstm_2", "recurrent_regularizer": null, "dropout": 0.0, "activity_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "activation": "softsign", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "unit_forget_bias": true, "kernel_constraint": null, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_dropout": 0.0, "recurrent_activation": "hard_sigmoid", "go_backwards": false, "recurrent_constraint": null, "implementation": 0}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "rate": 0.2}}, {"class_name": "Dense", "config": {"activation": "linear", "use_bias": true, "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "units": 1, "name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "linear"}}], "keras_version": "2.0.2"}