{"config": [{"config": {"name": "lstm_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "unroll": false, "recurrent_constraint": null, "kernel_constraint": null, "use_bias": true, "units": 50, "recurrent_activation": "hard_sigmoid", "dropout": 0.0, "bias_constraint": null, "batch_input_shape": [null, null, 12], "go_backwards": false, "activation": "softsign", "bias_regularizer": null, "implementation": 0, "recurrent_regularizer": null, "trainable": true, "dtype": "float32", "stateful": false, "return_sequences": true, "recurrent_dropout": 0.0, "unit_forget_bias": true, "kernel_regularizer": null}, "class_name": "LSTM"}, {"config": {"name": "dropout_1", "trainable": true, "rate": 0.2}, "class_name": "Dropout"}, {"config": {"units": 80, "name": "lstm_2", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "unroll": false, "recurrent_constraint": null, "kernel_constraint": null, "use_bias": true, "bias_constraint": null, "recurrent_activation": "hard_sigmoid", "dropout": 0.0, "kernel_regularizer": null, "go_backwards": false, "activation": "softsign", "bias_regularizer": null, "implementation": 0, "recurrent_regularizer": null, "trainable": true, "stateful": false, "return_sequences": false, "unit_forget_bias": true, "recurrent_dropout": 0.0}, "class_name": "LSTM"}, {"config": {"name": "dropout_2", "trainable": true, "rate": 0.2}, "class_name": "Dropout"}, {"config": {"name": "dense_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "units": 1, "activity_regularizer": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "use_bias": true, "activation": "linear", "trainable": true}, "class_name": "Dense"}, {"config": {"name": "activation_1", "activation": "linear", "trainable": true}, "class_name": "Activation"}], "keras_version": "2.0.2", "backend": "tensorflow", "class_name": "Sequential"}