{"class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"recurrent_regularizer": null, "implementation": 0, "unroll": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "trainable": true, "activity_regularizer": null, "use_bias": true, "name": "lstm_1", "dtype": "float32", "kernel_constraint": null, "bias_regularizer": null, "go_backwards": false, "dropout": 0.0, "unit_forget_bias": true, "bias_constraint": null, "activation": "softsign", "return_sequences": true, "recurrent_constraint": null, "batch_input_shape": [null, null, 12], "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_activation": "hard_sigmoid", "recurrent_dropout": 0.0, "bias_initializer": {"class_name": "Zeros", "config": {}}, "stateful": false, "units": 50}}, {"class_name": "Dropout", "config": {"rate": 0.3, "name": "dropout_1", "trainable": true}}, {"class_name": "LSTM", "config": {"recurrent_regularizer": null, "implementation": 0, "unroll": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "trainable": true, "activity_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_regularizer": null, "go_backwards": false, "dropout": 0.0, "unit_forget_bias": true, "bias_constraint": null, "activation": "softsign", "return_sequences": false, "recurrent_constraint": null, "name": "lstm_2", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_activation": "hard_sigmoid", "recurrent_dropout": 0.0, "units": 80, "stateful": false}}, {"class_name": "Dropout", "config": {"rate": 0.3, "name": "dropout_2", "trainable": true}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_constraint": null, "activation": "linear", "kernel_regularizer": null, "units": 1, "trainable": true, "activity_regularizer": null, "use_bias": true, "name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "config": {"activation": "linear", "name": "activation_1", "trainable": true}}], "keras_version": "2.0.2", "backend": "tensorflow"}