{"keras_version": "2.0.2", "class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"bias_regularizer": null, "stateful": false, "name": "lstm_1", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "units": 50, "use_bias": true, "unroll": false, "batch_input_shape": [null, null, 12], "recurrent_dropout": 0.0, "return_sequences": true, "recurrent_activation": "hard_sigmoid", "unit_forget_bias": true, "bias_constraint": null, "activation": "softsign", "dropout": 0.0, "implementation": 0, "recurrent_regularizer": null, "kernel_constraint": null, "dtype": "float32", "go_backwards": false, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "recurrent_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "rate": 0.2, "trainable": true}}, {"class_name": "LSTM", "config": {"bias_regularizer": null, "stateful": false, "go_backwards": false, "name": "lstm_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "kernel_constraint": null, "use_bias": true, "unroll": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "return_sequences": false, "recurrent_activation": "hard_sigmoid", "unit_forget_bias": true, "bias_constraint": null, "activation": "softsign", "dropout": 0.0, "implementation": 0, "recurrent_regularizer": null, "recurrent_dropout": 0.0, "trainable": true, "kernel_regularizer": null, "units": 80, "recurrent_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "rate": 0.2, "trainable": true}}, {"class_name": "Dense", "config": {"bias_constraint": null, "activation": "linear", "name": "dense_1", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "use_bias": true, "trainable": true, "bias_regularizer": null, "units": 1, "kernel_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "linear", "trainable": true}}], "backend": "tensorflow"}