{"backend": "tensorflow", "keras_version": "2.0.2", "class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"name": "lstm_1", "trainable": true, "return_sequences": true, "dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "unit_forget_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unroll": false, "go_backwards": false, "recurrent_regularizer": null, "implementation": 0, "stateful": false, "use_bias": true, "recurrent_dropout": 0.0, "dropout": 0.0, "recurrent_constraint": null, "kernel_regularizer": null, "units": 50, "activation": "softsign", "bias_constraint": null, "recurrent_activation": "hard_sigmoid", "batch_input_shape": [null, null, 12], "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "rate": 0.1}}, {"class_name": "LSTM", "config": {"name": "lstm_2", "trainable": true, "return_sequences": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "unit_forget_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unroll": false, "go_backwards": false, "recurrent_regularizer": null, "implementation": 0, "stateful": false, "use_bias": true, "recurrent_dropout": 0.0, "dropout": 0.0, "recurrent_constraint": null, "kernel_regularizer": null, "units": 80, "activation": "softsign", "bias_constraint": null, "recurrent_activation": "hard_sigmoid", "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "rate": 0.1}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "activation": "linear", "bias_constraint": null, "use_bias": true, "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "kernel_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "linear"}}]}