{"class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"trainable": true, "name": "lstm_1", "units": 50, "batch_input_shape": [null, null, 12], "recurrent_dropout": 0.0, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "activation": "softsign", "unit_forget_bias": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "stateful": false, "recurrent_activation": "hard_sigmoid", "return_sequences": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "dtype": "float32", "unroll": false, "go_backwards": false, "activity_regularizer": null, "bias_regularizer": null, "dropout": 0.0, "recurrent_constraint": null, "kernel_regularizer": null, "implementation": 0, "use_bias": true}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.2, "name": "dropout_1"}}, {"class_name": "LSTM", "config": {"trainable": true, "recurrent_activation": "hard_sigmoid", "units": 80, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "implementation": 0, "unit_forget_bias": true, "activation": "softsign", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "stateful": false, "name": "lstm_2", "return_sequences": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "unroll": false, "go_backwards": false, "activity_regularizer": null, "recurrent_dropout": 0.0, "dropout": 0.0, "recurrent_constraint": null, "kernel_regularizer": null, "use_bias": true}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.2, "name": "dropout_2"}}, {"class_name": "Dense", "config": {"trainable": true, "units": 1, "name": "dense_1", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_regularizer": null, "activation": "linear", "use_bias": true}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "linear"}}], "keras_version": "2.0.2", "backend": "tensorflow"}