{"class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "LSTM", "config": {"trainable": true, "unit_forget_bias": true, "bias_constraint": null, "use_bias": true, "dropout": 0.0, "recurrent_constraint": null, "recurrent_activation": "hard_sigmoid", "implementation": 0, "return_sequences": true, "name": "lstm_1", "kernel_regularizer": null, "go_backwards": false, "batch_input_shape": [null, null, 12], "activity_regularizer": null, "recurrent_dropout": 0.0, "unroll": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_regularizer": null, "dtype": "float32", "units": 50, "activation": "softsign", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "stateful": false, "bias_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "rate": 0.2}}, {"class_name": "LSTM", "config": {"unit_forget_bias": true, "bias_constraint": null, "use_bias": true, "dropout": 0.0, "recurrent_constraint": null, "recurrent_activation": "hard_sigmoid", "implementation": 0, "return_sequences": false, "name": "lstm_2", "kernel_regularizer": null, "go_backwards": false, "trainable": true, "activity_regularizer": null, "recurrent_dropout": 0.0, "unroll": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_regularizer": null, "units": 80, "activation": "softsign", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "stateful": false, "bias_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "rate": 0.2}}, {"class_name": "Dense", "config": {"trainable": true, "activity_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "units": 1, "activation": "linear", "name": "dense_1", "bias_regularizer": null, "kernel_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "linear", "name": "activation_1"}}], "keras_version": "2.0.2"}