{"config": [{"config": {"trainable": true, "recurrent_dropout": 0.0, "return_sequences": true, "stateful": false, "batch_input_shape": [null, null, 12], "bias_regularizer": null, "activation": "softsign", "dtype": "float32", "unroll": false, "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "recurrent_activation": "hard_sigmoid", "units": 50, "kernel_regularizer": null, "go_backwards": false, "recurrent_regularizer": null, "name": "lstm_1", "unit_forget_bias": true, "kernel_constraint": null, "activity_regularizer": null, "implementation": 0, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "recurrent_constraint": null, "dropout": 0.0, "use_bias": true}, "class_name": "LSTM"}, {"config": {"trainable": true, "rate": 0.2, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"trainable": true, "recurrent_dropout": 0.0, "return_sequences": false, "stateful": false, "activation": "softsign", "bias_constraint": null, "kernel_constraint": null, "units": 80, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "recurrent_activation": "hard_sigmoid", "bias_regularizer": null, "kernel_regularizer": null, "dropout": 0.0, "recurrent_regularizer": null, "name": "lstm_2", "unit_forget_bias": true, "unroll": false, "activity_regularizer": null, "implementation": 0, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "recurrent_constraint": null, "go_backwards": false, "use_bias": true}, "class_name": "LSTM"}, {"config": {"trainable": true, "rate": 0.2, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"trainable": true, "kernel_regularizer": null, "activation": "linear", "name": "dense_1", "use_bias": true, "units": 1, "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "linear", "name": "activation_1"}, "class_name": "Activation"}], "keras_version": "2.0.2", "backend": "tensorflow", "class_name": "Sequential"}