{"keras_version": "2.0.2", "class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "LSTM", "config": {"trainable": true, "use_bias": true, "kernel_constraint": null, "return_sequences": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "kernel_regularizer": null, "bias_regularizer": null, "go_backwards": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 50, "unroll": false, "dropout": 0.0, "recurrent_dropout": 0.0, "name": "lstm_1", "activation": "softsign", "dtype": "float32", "unit_forget_bias": true, "batch_input_shape": [null, null, 12], "recurrent_regularizer": null, "recurrent_constraint": null, "stateful": false, "implementation": 0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_constraint": null, "recurrent_activation": "hard_sigmoid", "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "rate": 0.2}}, {"class_name": "LSTM", "config": {"trainable": true, "use_bias": true, "kernel_constraint": null, "return_sequences": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "kernel_regularizer": null, "bias_regularizer": null, "go_backwards": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 80, "unroll": false, "dropout": 0.0, "recurrent_dropout": 0.0, "name": "lstm_2", "activation": "softsign", "implementation": 0, "unit_forget_bias": true, "recurrent_regularizer": null, "recurrent_constraint": null, "stateful": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_constraint": null, "recurrent_activation": "hard_sigmoid", "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "rate": 0.2}}, {"class_name": "Dense", "config": {"trainable": true, "name": "dense_1", "use_bias": true, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "linear"}}]}