{"backend": "tensorflow", "config": [{"config": {"recurrent_constraint": null, "dtype": "float32", "stateful": false, "recurrent_activation": "hard_sigmoid", "return_sequences": true, "units": 50, "unit_forget_bias": true, "recurrent_dropout": 0.0, "implementation": 0, "kernel_regularizer": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "dropout": 0.0, "bias_constraint": null, "recurrent_regularizer": null, "go_backwards": false, "activity_regularizer": null, "unroll": false, "use_bias": true, "bias_regularizer": null, "name": "lstm_1", "kernel_constraint": null, "activation": "softsign", "batch_input_shape": [null, null, 12], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "trainable": true}, "class_name": "LSTM"}, {"config": {"rate": 0.2, "trainable": true, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"recurrent_constraint": null, "stateful": false, "recurrent_activation": "hard_sigmoid", "return_sequences": false, "units": 80, "unit_forget_bias": true, "recurrent_dropout": 0.0, "implementation": 0, "kernel_regularizer": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "dropout": 0.0, "bias_constraint": null, "recurrent_regularizer": null, "go_backwards": false, "activity_regularizer": null, "unroll": false, "use_bias": true, "bias_regularizer": null, "name": "lstm_2", "kernel_constraint": null, "activation": "softsign", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "trainable": true}, "class_name": "LSTM"}, {"config": {"rate": 0.2, "trainable": true, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "use_bias": true, "units": 1, "kernel_regularizer": null, "name": "dense_1", "kernel_constraint": null, "activation": "linear", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "trainable": true}, "class_name": "Dense"}, {"config": {"activation": "linear", "trainable": true, "name": "activation_1"}, "class_name": "Activation"}], "keras_version": "2.0.2", "class_name": "Sequential"}