{"keras_version": "2.0.2", "config": [{"class_name": "LSTM", "config": {"kernel_constraint": null, "implementation": 0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_constraint": null, "unroll": false, "recurrent_activation": "hard_sigmoid", "recurrent_constraint": null, "activity_regularizer": null, "return_sequences": true, "kernel_regularizer": null, "unit_forget_bias": true, "trainable": true, "activation": "softsign", "dropout": 0.0, "recurrent_dropout": 0.0, "use_bias": true, "go_backwards": false, "batch_input_shape": [null, null, 12], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "name": "lstm_1", "stateful": false, "units": 50, "recurrent_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "dtype": "float32"}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.2, "name": "dropout_1"}}, {"class_name": "LSTM", "config": {"kernel_constraint": null, "implementation": 0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "recurrent_activation": "hard_sigmoid", "unroll": false, "recurrent_constraint": null, "activity_regularizer": null, "return_sequences": false, "kernel_regularizer": null, "bias_constraint": null, "unit_forget_bias": true, "trainable": true, "activation": "softsign", "dropout": 0.0, "recurrent_dropout": 0.0, "use_bias": true, "go_backwards": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "name": "lstm_2", "stateful": false, "units": 80, "recurrent_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.1, "name": "dropout_2"}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "units": 1, "trainable": true, "activation": "linear", "name": "dense_1"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "linear", "name": "activation_1"}}], "backend": "tensorflow", "class_name": "Sequential"}