{"keras_version": "2.0.2", "backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "batch_input_shape": [null, null, 12], "recurrent_regularizer": null, "use_bias": true, "activation": "softsign", "dtype": "float32", "units": 50, "dropout": 0.0, "go_backwards": false, "name": "lstm_1", "implementation": 0, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unroll": false, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "recurrent_dropout": 0.0, "trainable": true, "return_sequences": true, "recurrent_constraint": null, "bias_regularizer": null, "stateful": false, "kernel_regularizer": null, "bias_constraint": null, "unit_forget_bias": true, "activity_regularizer": null, "recurrent_activation": "hard_sigmoid"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "rate": 0.2}}, {"class_name": "LSTM", "config": {"recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "recurrent_regularizer": null, "use_bias": true, "activation": "softsign", "units": 80, "dropout": 0.0, "go_backwards": false, "name": "lstm_2", "implementation": 0, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unroll": false, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "recurrent_dropout": 0.0, "trainable": true, "return_sequences": false, "recurrent_constraint": null, "bias_regularizer": null, "stateful": false, "kernel_regularizer": null, "bias_constraint": null, "unit_forget_bias": true, "activity_regularizer": null, "recurrent_activation": "hard_sigmoid"}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "rate": 0.2}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "use_bias": true, "trainable": true, "bias_regularizer": null, "activation": "linear", "kernel_regularizer": null, "bias_constraint": null, "units": 1, "name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "linear", "trainable": true, "name": "activation_1"}}]}