{"backend": "tensorflow", "keras_version": "2.0.2", "config": [{"config": {"stateful": false, "dropout": 0.0, "implementation": 0, "recurrent_constraint": null, "name": "lstm_1", "bias_regularizer": null, "kernel_regularizer": null, "go_backwards": false, "recurrent_activation": "hard_sigmoid", "recurrent_regularizer": null, "activity_regularizer": null, "return_sequences": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "recurrent_dropout": 0.0, "trainable": true, "unroll": false, "unit_forget_bias": true, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "kernel_constraint": null, "units": 50, "bias_constraint": null, "activation": "softsign", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "batch_input_shape": [null, null, 12]}, "class_name": "LSTM"}, {"config": {"rate": 0.2, "name": "dropout_1", "trainable": true}, "class_name": "Dropout"}, {"config": {"stateful": false, "dropout": 0.0, "unroll": false, "recurrent_constraint": null, "name": "lstm_2", "units": 80, "kernel_regularizer": null, "recurrent_activation": "hard_sigmoid", "recurrent_regularizer": null, "activity_regularizer": null, "return_sequences": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "recurrent_dropout": 0.0, "trainable": true, "go_backwards": false, "unit_forget_bias": true, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "kernel_constraint": null, "implementation": 0, "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "activation": "softsign"}, "class_name": "LSTM"}, {"config": {"rate": 0.2, "name": "dropout_2", "trainable": true}, "class_name": "Dropout"}, {"config": {"activation": "linear", "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "name": "dense_1", "trainable": true, "kernel_constraint": null, "units": 1, "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"activation": "linear", "name": "activation_1", "trainable": true}, "class_name": "Activation"}], "class_name": "Sequential"}