{"class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "units": 50, "recurrent_constraint": null, "bias_regularizer": null, "implementation": 0, "dropout": 0.0, "recurrent_activation": "hard_sigmoid", "bias_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "return_sequences": true, "batch_input_shape": [null, null, 12], "go_backwards": false, "use_bias": true, "unroll": false, "kernel_regularizer": null, "activation": "softsign", "bias_initializer": {"class_name": "Zeros", "config": {}}, "stateful": false, "recurrent_dropout": 0.0, "dtype": "float32", "unit_forget_bias": true, "recurrent_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "name": "lstm_1", "trainable": true}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "rate": 0.2}}, {"class_name": "LSTM", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "units": 80, "recurrent_constraint": null, "bias_regularizer": null, "implementation": 0, "trainable": true, "bias_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "return_sequences": false, "go_backwards": false, "use_bias": true, "unroll": false, "recurrent_dropout": 0.0, "activation": "softsign", "bias_initializer": {"class_name": "Zeros", "config": {}}, "stateful": false, "kernel_regularizer": null, "name": "lstm_2", "unit_forget_bias": true, "recurrent_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "recurrent_activation": "hard_sigmoid", "dropout": 0.0}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "rate": 0.1}}, {"class_name": "Dense", "config": {"name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "units": 1, "activation": "linear", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "use_bias": true, "trainable": true}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "linear", "name": "activation_1"}}], "backend": "tensorflow", "keras_version": "2.0.2"}