{"class_name": "Sequential", "keras_version": "2.0.2", "backend": "tensorflow", "config": [{"class_name": "LSTM", "config": {"recurrent_constraint": null, "go_backwards": false, "unroll": false, "bias_constraint": null, "return_sequences": true, "stateful": false, "dtype": "float32", "name": "lstm_1", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "implementation": 0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "bias_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "units": 50, "activity_regularizer": null, "use_bias": true, "unit_forget_bias": true, "recurrent_activation": "hard_sigmoid", "kernel_regularizer": null, "dropout": 0.0, "recurrent_dropout": 0.0, "activation": "softsign", "recurrent_regularizer": null, "batch_input_shape": [null, null, 12]}}, {"class_name": "Dropout", "config": {"rate": 0.2, "trainable": true, "name": "dropout_1"}}, {"class_name": "LSTM", "config": {"recurrent_constraint": null, "go_backwards": false, "unroll": false, "bias_constraint": null, "return_sequences": false, "stateful": false, "kernel_constraint": null, "name": "lstm_2", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "implementation": 0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "bias_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "units": 80, "activity_regularizer": null, "use_bias": true, "unit_forget_bias": true, "recurrent_activation": "hard_sigmoid", "kernel_regularizer": null, "dropout": 0.0, "recurrent_dropout": 0.0, "activation": "softsign", "recurrent_regularizer": null}}, {"class_name": "Dropout", "config": {"rate": 0.2, "trainable": true, "name": "dropout_2"}}, {"class_name": "Dense", "config": {"bias_constraint": null, "bias_regularizer": null, "units": 1, "activity_regularizer": null, "use_bias": true, "kernel_constraint": null, "kernel_regularizer": null, "name": "dense_1", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}}}, {"class_name": "Activation", "config": {"activation": "linear", "name": "activation_1", "trainable": true}}]}