{"keras_version": "2.0.2", "class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "LSTM", "config": {"dtype": "float32", "kernel_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "return_sequences": true, "dropout": 0.0, "units": 50, "unit_forget_bias": true, "kernel_constraint": null, "go_backwards": false, "recurrent_activation": "hard_sigmoid", "name": "lstm_1", "bias_constraint": null, "recurrent_regularizer": null, "implementation": 0, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_dropout": 0.0, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "recurrent_constraint": null, "batch_input_shape": [null, null, 12], "stateful": false, "unroll": false, "bias_regularizer": null, "activation": "softsign", "trainable": true, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "rate": 0.2}}, {"class_name": "LSTM", "config": {"kernel_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "return_sequences": false, "dropout": 0.0, "units": 80, "unit_forget_bias": true, "kernel_constraint": null, "unroll": false, "recurrent_activation": "hard_sigmoid", "go_backwards": false, "name": "lstm_2", "bias_constraint": null, "recurrent_regularizer": null, "implementation": 0, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "recurrent_constraint": null, "stateful": false, "recurrent_dropout": 0.0, "bias_regularizer": null, "activation": "softsign", "trainable": true, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "rate": 0.2}}, {"class_name": "Dense", "config": {"name": "dense_1", "bias_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "bias_regularizer": null, "units": 1, "activation": "linear", "trainable": true, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "linear"}}]}