{"config": [{"config": {"units": 50, "bias_regularizer": null, "implementation": 0, "unroll": false, "return_sequences": true, "kernel_regularizer": null, "trainable": true, "batch_input_shape": [null, null, 12], "activation": "softsign", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "go_backwards": false, "dropout": 0.0, "unit_forget_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "recurrent_dropout": 0.0, "stateful": false, "recurrent_regularizer": null, "recurrent_constraint": null, "bias_constraint": null, "kernel_constraint": null, "name": "lstm_1", "dtype": "float32", "recurrent_activation": "hard_sigmoid", "activity_regularizer": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}}, "class_name": "LSTM"}, {"config": {"name": "dropout_1", "trainable": true, "rate": 0.2}, "class_name": "Dropout"}, {"config": {"units": 80, "name": "lstm_2", "implementation": 0, "unroll": false, "return_sequences": false, "kernel_regularizer": null, "trainable": true, "activation": "softsign", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "go_backwards": false, "dropout": 0.0, "unit_forget_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "recurrent_dropout": 0.0, "stateful": false, "recurrent_regularizer": null, "recurrent_constraint": null, "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "recurrent_activation": "hard_sigmoid", "activity_regularizer": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}}, "class_name": "LSTM"}, {"config": {"name": "dropout_2", "trainable": true, "rate": 0.2}, "class_name": "Dropout"}, {"config": {"kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "units": 1, "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "bias_constraint": null, "use_bias": true, "name": "dense_1", "activity_regularizer": null, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"name": "activation_1", "trainable": true, "activation": "linear"}, "class_name": "Activation"}], "keras_version": "2.0.2", "backend": "tensorflow", "class_name": "Sequential"}