{"config": [{"config": {"recurrent_regularizer": null, "activity_regularizer": null, "return_sequences": true, "go_backwards": false, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "implementation": 0, "trainable": true, "dtype": "float32", "recurrent_activation": "hard_sigmoid", "activation": "softsign", "use_bias": true, "dropout": 0.0, "unit_forget_bias": true, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_dropout": 0.0, "bias_regularizer": null, "name": "lstm_1", "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "recurrent_constraint": null, "stateful": false, "batch_input_shape": [null, null, 12], "bias_constraint": null, "units": 50, "unroll": false}, "class_name": "LSTM"}, {"config": {"name": "dropout_1", "rate": 0.2, "trainable": true}, "class_name": "Dropout"}, {"config": {"recurrent_regularizer": null, "activity_regularizer": null, "return_sequences": false, "go_backwards": false, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "implementation": 0, "trainable": true, "recurrent_activation": "hard_sigmoid", "activation": "softsign", "use_bias": true, "dropout": 0.0, "unit_forget_bias": true, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_dropout": 0.0, "bias_regularizer": null, "name": "lstm_2", "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "stateful": false, "recurrent_constraint": null, "bias_constraint": null, "units": 80, "unroll": false}, "class_name": "LSTM"}, {"config": {"name": "dropout_2", "rate": 0.2, "trainable": true}, "class_name": "Dropout"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "name": "dense_1", "kernel_constraint": null, "trainable": true, "activation": "linear", "bias_constraint": null, "use_bias": true, "units": 1, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "activation_1", "activation": "linear", "trainable": true}, "class_name": "Activation"}], "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.0.2"}