{"keras_version": "2.0.2", "class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"kernel_regularizer": null, "return_sequences": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "unroll": false, "dtype": "float32", "stateful": false, "go_backwards": false, "recurrent_dropout": 0.0, "activity_regularizer": null, "use_bias": true, "recurrent_activation": "hard_sigmoid", "dropout": 0.0, "recurrent_regularizer": null, "activation": "softsign", "batch_input_shape": [null, null, 12], "implementation": 0, "unit_forget_bias": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "units": 50, "trainable": true, "name": "lstm_1", "bias_regularizer": null, "bias_constraint": null, "recurrent_constraint": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "rate": 0.2, "trainable": true}}, {"class_name": "LSTM", "config": {"kernel_regularizer": null, "return_sequences": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "unroll": false, "stateful": false, "go_backwards": false, "recurrent_dropout": 0.0, "activity_regularizer": null, "use_bias": true, "recurrent_activation": "hard_sigmoid", "dropout": 0.0, "recurrent_regularizer": null, "activation": "softsign", "bias_regularizer": null, "implementation": 0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "units": 80, "trainable": true, "name": "lstm_2", "unit_forget_bias": true, "bias_constraint": null, "recurrent_constraint": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "rate": 0.2, "trainable": true}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "units": 1, "trainable": true, "name": "dense_1", "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "use_bias": true, "kernel_constraint": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "linear", "trainable": true}}], "backend": "tensorflow"}