{"backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.0.2", "config": [{"class_name": "LSTM", "config": {"return_sequences": true, "recurrent_dropout": 0.0, "name": "lstm_1", "unit_forget_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "batch_input_shape": [null, null, 12], "trainable": true, "units": 50, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "go_backwards": false, "use_bias": true, "recurrent_constraint": null, "activity_regularizer": null, "recurrent_regularizer": null, "implementation": 0, "unroll": false, "dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "recurrent_activation": "hard_sigmoid", "bias_constraint": null, "dtype": "float32", "activation": "softsign", "kernel_constraint": null, "stateful": false, "bias_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "rate": 0.2, "trainable": true}}, {"class_name": "LSTM", "config": {"return_sequences": false, "recurrent_dropout": 0.0, "name": "lstm_2", "unit_forget_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "recurrent_regularizer": null, "trainable": true, "units": 80, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "activation": "softsign", "recurrent_constraint": null, "activity_regularizer": null, "implementation": 0, "go_backwards": false, "unroll": false, "dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "recurrent_activation": "hard_sigmoid", "bias_constraint": null, "use_bias": true, "kernel_constraint": null, "stateful": false, "bias_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "rate": 0.2, "trainable": true}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "use_bias": true, "activity_regularizer": null, "name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "units": 1, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "bias_regularizer": null, "kernel_constraint": null, "activation": "linear"}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "linear"}}]}