{"config": [{"config": {"return_sequences": true, "implementation": 0, "recurrent_constraint": null, "name": "lstm_1", "stateful": false, "activation": "softsign", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "recurrent_dropout": 0.0, "trainable": true, "unroll": false, "recurrent_regularizer": null, "unit_forget_bias": true, "go_backwards": false, "recurrent_activation": "hard_sigmoid", "bias_regularizer": null, "dtype": "float32", "use_bias": true, "batch_input_shape": [null, null, 12], "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "dropout": 0.0, "units": 50, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "LSTM"}, {"config": {"name": "dropout_1", "trainable": true, "rate": 0.2}, "class_name": "Dropout"}, {"config": {"return_sequences": false, "implementation": 0, "recurrent_constraint": null, "name": "lstm_2", "stateful": false, "recurrent_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "recurrent_dropout": 0.0, "trainable": true, "unroll": false, "activation": "softsign", "unit_forget_bias": true, "go_backwards": false, "recurrent_activation": "hard_sigmoid", "bias_regularizer": null, "use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "dropout": 0.0, "units": 80, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "LSTM"}, {"config": {"name": "dropout_2", "trainable": true, "rate": 0.2}, "class_name": "Dropout"}, {"config": {"bias_regularizer": null, "name": "dense_1", "use_bias": true, "activation": "linear", "activity_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_constraint": null, "units": 1, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"activation": "linear", "name": "activation_1", "trainable": true}, "class_name": "Activation"}], "class_name": "Sequential", "keras_version": "2.0.2", "backend": "tensorflow"}