{"config": [{"config": {"batch_input_shape": [null, null, 12], "bias_constraint": null, "bias_regularizer": null, "return_sequences": true, "trainable": true, "dropout": 0.0, "unit_forget_bias": true, "recurrent_constraint": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "name": "lstm_1", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "stateful": false, "go_backwards": false, "unroll": false, "dtype": "float32", "activity_regularizer": null, "recurrent_regularizer": null, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "softsign", "implementation": 0, "recurrent_activation": "hard_sigmoid", "units": 50, "recurrent_dropout": 0.0, "kernel_regularizer": null}, "class_name": "LSTM"}, {"config": {"name": "dropout_1", "trainable": true, "rate": 0.2}, "class_name": "Dropout"}, {"config": {"bias_constraint": null, "bias_regularizer": null, "return_sequences": false, "trainable": true, "dropout": 0.0, "unit_forget_bias": true, "recurrent_constraint": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "name": "lstm_2", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "stateful": false, "go_backwards": false, "unroll": false, "activity_regularizer": null, "recurrent_regularizer": null, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "softsign", "implementation": 0, "recurrent_activation": "hard_sigmoid", "units": 80, "recurrent_dropout": 0.0, "kernel_regularizer": null}, "class_name": "LSTM"}, {"config": {"name": "dropout_2", "trainable": true, "rate": 0.2}, "class_name": "Dropout"}, {"config": {"bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "activation": "linear", "units": 1, "name": "dense_1", "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"name": "activation_1", "activation": "linear", "trainable": true}, "class_name": "Activation"}], "keras_version": "2.0.2", "backend": "tensorflow", "class_name": "Sequential"}