{"class_name": "Sequential", "keras_version": "2.0.2", "config": [{"class_name": "LSTM", "config": {"stateful": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "return_sequences": true, "activation": "softsign", "unroll": false, "name": "lstm_1", "implementation": 0, "bias_constraint": null, "dtype": "float32", "kernel_regularizer": null, "activity_regularizer": null, "recurrent_regularizer": null, "kernel_constraint": null, "batch_input_shape": [null, null, 12], "bias_regularizer": null, "dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_activation": "hard_sigmoid", "recurrent_constraint": null, "use_bias": true, "units": 50, "unit_forget_bias": true, "trainable": true, "recurrent_dropout": 0.0, "go_backwards": false}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "rate": 0.2}}, {"class_name": "LSTM", "config": {"stateful": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_regularizer": null, "activation": "softsign", "unroll": false, "name": "lstm_2", "implementation": 0, "bias_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_regularizer": null, "dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "use_bias": true, "recurrent_activation": "hard_sigmoid", "recurrent_constraint": null, "return_sequences": false, "units": 80, "unit_forget_bias": true, "trainable": true, "recurrent_dropout": 0.0, "go_backwards": false}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "rate": 0.2}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_regularizer": null, "trainable": true, "activation": "linear", "use_bias": true, "units": 1, "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "linear"}}], "backend": "tensorflow"}