{"class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"recurrent_dropout": 0.0, "return_sequences": true, "name": "lstm_1", "implementation": 0, "stateful": false, "unit_forget_bias": true, "recurrent_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "use_bias": true, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "activation": "softsign", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_activation": "hard_sigmoid", "kernel_constraint": null, "go_backwards": false, "units": 50, "bias_regularizer": null, "activity_regularizer": null, "trainable": true, "dropout": 0.0, "kernel_regularizer": null, "batch_input_shape": [null, null, 12], "unroll": false, "recurrent_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.2, "name": "dropout_1"}}, {"class_name": "LSTM", "config": {"return_sequences": false, "name": "lstm_2", "implementation": 0, "stateful": false, "unit_forget_bias": true, "recurrent_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "use_bias": true, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "softsign", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_dropout": 0.0, "kernel_constraint": null, "dropout": 0.0, "units": 80, "bias_regularizer": null, "activity_regularizer": null, "trainable": true, "go_backwards": false, "kernel_regularizer": null, "recurrent_activation": "hard_sigmoid", "unroll": false, "recurrent_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.2, "name": "dropout_2"}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "units": 1, "bias_regularizer": null, "name": "dense_1", "activity_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "use_bias": true, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "activation": "linear"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "linear"}}], "backend": "tensorflow", "keras_version": "2.0.2"}